{
  "courseId": "florida_laws_lh",
  "title": "Florida Laws - Life & Health Insurance",
  "description": "Florida-specific laws, rules, and regulations for Life and Health Insurance licensing.",
  "totalChapters": 3,
  "chapters": [
    {
      "title": "Florida Laws Common to All Lines of Insurance",
      "id": "common_all_lines",
      "content": "OFFICE OF INSURANCE REGULATION\n\n• The mission of the Office of Insurance Regulation is to promote the public welfare by maintaining the solvency of insurance companies.\n\n• The Office of Insurance Regulation has primary responsibility for regulation, compliance and enforcement of statutes related to the business of insurance and the monitoring of industry markets.\n\n• The insurance policy forms used in Florida are approved by the Office of Insurance Regulation (OIR)\n\nInsurance laws in Florida are administered by the Chief Financial Officer, the Financial Services Commission and the Commissioner of the Office of Insurance Regulation. The Chief Financial Officer (CFO) is independently elected and serves as the head of the Department of Financial Services. Although commissioners are sometimes elected, they are mainly appointed by the governor.\n\nBUREAU OF UNCLAIMED PROPERTY\n\n• The Chief Financial Officer oversees the Bureau of Unclaimed Property, which holds unclaimed property accounts valued at more than $1 Billion, mostly from dormant accounts in financial institutions, insurance and utility companies, securities and trust holdings.\n\nHEARINGS\n\n• The Financial Services Commission may hold hearings for any purpose within the scope of the insurance code deemed necessary, such as:\n\n   ◦ Person engaging in unfair competition, or any unfair or deceptive act\n\n   ◦ Person engaging in business of insurance without a license\n\n   ◦ The best interest of the public would be served\n\nLICENSING\n\n• A licensee may not transact insurance business in Florida until the licensee is appointed by an insurer. Individuals looking to acquire an insurance license must meet the following eligibility requirements:\n\n   ◦ Must be at least 18 years old\n\n   ◦ Must be a US citizen or legal alien\n\n   ◦ Must be a Florida resident\n\n   ◦ May not be an employee of the United States Department of Veterans Affairs\n\n   ◦ May not be a funeral director or direct disposer\n\n   ◦ Complete a 40-Hour pre-licensing education course\n\n   ◦ Pass the insurance state licensing examination\n\n   ◦ Must be trustworthy and competent\n\n• Continuing education\n\n   ◦ An agent needs to abide by the following guidelines every two years to maintain their license:\n\n   ◦ 24 hours of continuing education every two years for agents licensed less than 6 years\n\n   ◦ 20 hours of continuing education for every two years for agents licensed more than 6 years\n\n   ◦ Any continuing education must include a minimum 5 hours in ethics\n\n   ◦ Pay license fees, appointment and renewal fee\n\n   ◦ Continue to be appointed with an insurance company\n\n• Suspension, termination, revoking of a license\n\n   ◦ The Chief Financial Officer has the power to suspend or revoke the license of an insurance agent who violates the Insurance Code. In lieu of suspension or revocation, the CFO has the authority to issue fines or order probation.\n\n   ◦ Agent\n\n• An agent is an individual who has been authorized by an insurer to be its representative and to perform all of the following acts:\n\n   ◦ Solicit applications for insurance\n\n   ◦ Collect premiums from policyowners\n\n   ◦ Render services to prospects and clients\n\n   ◦ Field underwriting if necessary\n\nAPPOINTMENT\n\n• The authority given to an agent to transact business on behalf of the insurer is called appointment.\n\nCHANGE OF ADDRESS\n\n• If an agent changes his/her residence address, the Department of Financial Services must be notified within 30 days.\n\nREPORTING OF ACTIONS\n\n• If an agent is found guilty of a felony, he/she is required to notify the Department of Insurance within 30 days.\n\nAGENCIES\n\n• An insurance agency is any business location where insurance transactions take place that can only be performed by licensed insurance agents\n\n• There must be an agent in charge at each licensed agency location where insurance transactions take place\n\n• A licensed insurance agent may be the agent in charge of additional branch office locations of the agency as long as insurance activities do not occur at any location when the agent is not physically present\n\nHOME AGENCIES\n\n• The Department of Financial Services considers all of these factors when determining whether an agent’s home is an insurance agency:\n\n• Listing the location address on business cards/marketing materials and solicits business to be done at that location\n\n• There is a sign on the house indicating an agent is there\n\n• The agent meets clients there\n\n• Insurance transactions take place at the location\n\nPROFESSIONAL EMPLOYER ORGANIZATION\n\n• A Professional Employer Organization typically handles only administration functions.\n\n“INSURANCE TRANSACTION” INCLUDES ANY OF THE FOLLOWING:\n\n• Solicitation or inducement to purchase insurance\n\n• Negotiations toward the sale of insurance\n\n• Executing a contract of insurance\n\n• Issuing an insurance contract\n\n• Advising on coverages and claims\n\nA licensee may not transact insurance business in Florida until the licensee is appointed by an insurer. The agent's primary responsibility in the application process is to the insurer.\n\nTwisting occurs when an insurance agent convinces a policyowner to cancel their current policy so that they can purchase new life insurance policy with another company. This would involve the agent using misrepresentations or incomplete comparisons of the advantages and disadvantages of the two policies. Twisting is a form of misrepresentation and is illegal.\n\nChurning occurs when an agent has a policyholder replace one policy for another with the same company for the sole purpose of making more commission. This can involve using the cash value and/or dividends of an existing policy to purchase another policy with the same insurer. This normally is done using misrepresentation or deception and is not in the policyholder’s best interest.\n\nSliding occurs when an agent tells an applicant that in order to get the product they want, they are required by law to get an additional product as well. It can also mean falsely representing to an applicant that specific coverage is included in the policy applied for with no additional charge.\n\nCoercion is when an agent uses physical or mental force, with the intent of convincing an applicant to buy insurance.\n\nMisrepresentation is when an agent uses publications, sales materials, or makes statements that are false, misleading, or deceptive to unfairly influence the purchase of a policy.\n\nDefamation occurs when an oral or written statement is maliciously made that is intended to injure a person in the insurance business or be critical and misleading about the financial condition of a person or company.\n\nFraud occurs when someone intentionally deceives another with the intent to gain financially.\n\nIt is an illegal practice to unfairly discriminate against a person in any way on an insurance-related matter. An example would be providing different terms of coverage for different policyowners in the same risk classification. Fair discrimination is necessary for the issuance of life insurance policies, which is based on mortality.\n\nControlled business is coverage written by an agent on his/her own life, health, property, immediate family, or business associates. Most states will not issue a license to a person if it is determined that their primary purpose is to write controlled business.\n\nRebating happens when an agent refunds part of their commission, or exchanges anything of value to induce someone to purchase an insurance policy. Rebating is allowed in Florida if the agent rebates insureds in the same actuarial class.\n\nIt is an illegal practice to falsely advertise insurance products or publish misleading information about its insurance coverage. This includes making false statements about the financial condition of an insurer.\n\nThe following acts, omissions, or practices are defined as unfair and deceptive claim settlement practices, when knowingly committed or performed with such frequency as to indicate a general business practice, and are prohibited:\n\n• Misrepresenting to insured’s pertinent facts or policy provisions relating to coverage at issue\n\n• Failing to acknowledge and act reasonably promptly upon communications with respect to an insurance claim\n\n• Failing to adopt and implement reasonable standards for prompt investigation and processing of insured’s claims\n\n• Failing to affirm or deny coverage of claims within a reasonable time after proof of loss statements are completed and submitted by insured\n\n• Not attempting in good faith to effect prompt, fair and equitable settlements of claims on which liability has become reasonably clear; Refusing or delaying a settlement solely because there is other insurance available to partially or entirely satisfy the claim loss; the claimant who has a right to recover from more than one insurer has the right to choose the coverage from which to recover and the order in which payment is to be made\n\n• Compelling insured to initiate suits to recover amounts due under an insurance policy by offering substantially less than the amount ultimately recovered in those suits\n\nInsurance companies are classified according to the location of its corporation. Regardless of where the insurance company is incorporated, it still has to get a Certificate of Authority before transacting insurance within a state.\n\n• Domestic insurance company: A company that resides and is incorporated under the laws of the state in which its home office is located.\n\n• Foreign insurance company: A company whose home office is located in another state. It is considered to be a foreign company in all states except for its home state.\n\n• Alien insurance company: is one that is chartered and organized in any country other than the United States. It is considered an alien insurance company in all states.\n\nAuthorized insurer: An insurance company that has qualified and received a Certificate of Authority from the Department of Insurance (or sometimes called Department of Financial Services) to sell insurance in that state. Also called an admitted insurance company\n\nUnauthorized Insurer: An insurance company that has been denied or not yet applied for a Certificate of Authority and may not sell insurance in that state. Also called a non-admitted insurance company\n\nStock Insurance Company: An insurance company that is owned and controlled by stockholders (shareholders). The stockholders provide the capital and share in profits or losses.\n\nMutual life insurance companies are owned and controlled by its policyowners. These policyholders elect a board of trustees or directors to manage the firm. The profits of a mutual insurance company are returned to the policy owners in the form of dividends or retained as surplus to meet future obligations.\n\nADVERTISEMENT MAY INCLUDE ANY METHOD OF COMMUNICATION:\n\n• In a newspaper, magazine, or other publication\n\n• In the form of a notice, circular, pamphlet, letter, or poster\n\n• Over radio or television\n\nADVERTISEMENT DOES NOT INCLUDE:\n\n• Material used solely for the training and education of an insurer’s employees, agents, or brokers\n\n• Internal communication within an insurer’s own organization\n\n• Correspondence between a prospective group or blanket policyholder and an insurer during negotiations\n\nTestimonials and endorsements used in advertisements must be genuine and represent the current opinion of the author.\n\nAn advertisement must not directly or indirectly make unfair or incomplete comparisons of policies, contracts, or benefits.\n\nThe name of the actual insurer must be stated in all of the insurer’s advertisements. The form number or numbers of the policy advertised must be stated in any invitation to contract. An advertisement must not use a trade name, name of the parent company of the insurer, or any other device that would be misleading to the true identity of the actual insurer.\n\nAn advertisement must not contain statements that are untrue or misleading with respect to the assets, corporate structure, financial standing, age, or relative position of the insurer.\n\nEach insurer must maintain at its home office a complete file of its advertising materials, available for inspection, for a period of 4 years.\n\nAn agent is allowed to give advertising gifts to a prospective customer, provided they do not exceed $25.\n\nThe Florida Life and Health Insurance Guaranty Association was established to provide funds to protect an insured in the event of an insurer's insolvency.\n\nTrade practices: The life insurance industry has been declared to be a public trust in which service of all agents of all companies have a common obligation to work together in serving the best interest of the insuring public.\n\nFiduciary responsibility: An agent must handle funds of a client or insurance company honestly and fairly and NOT use them for the agent's own purposes.\n\nLicensed Agents: Agents may not submit applications to an insurer unless the name of the insurer is legibly typed or printed on the first page of the application at the time coverage is bound or the premium is quoted. The application must also disclose the name and license identification number of the agent as shown on the agent's license. This information must be legibly typed, printed, stamped, or written. A copy of the completed application must be provided to the prospective insured.\n\nThe National Association of Insurance and Financial Advisors, NAIFA, is a professional organization whose code of ethics is incorporated into Florida law and whose responsibility it is to establish the activities of agents."
    },
    {
      "title": "Florida Laws Pertinent to Life Insurance",
      "id": "life_insurance",
      "content": "◦ The “rules of disclosure” review what needs to be provided to each prospective purchaser of a life insurance policy. This includes a buyer’s guide, policy summary, and 14 day free-look period.\n\n   ◦ The minimum age at which an individual can sign a life insurance application is 15 years.\n\n   ◦ A provision that the policy terms shall be incontestable after it has been in force for a period of 2 years from its date of issue (unless the purpose for taking out the coverage was fraud).\n\n   ◦ Free Look provision allows an insured a period of 14 days from the delivery date of the policy to look over the new policy and return it for a full premium refund if dissatisfied for any reason.\n\n• The 14 day period begins when the applicant receives the policy in the mail or is delivered by an agent.\n\n   ◦ Buyer's Guide provides basic information about an insurance policy. This document explains how a buyer should go about choosing the amount and type of insurance to buy, and how a buyer can save money by comparing the cost of similar policies.\n\n   ◦ Life insurance policies must provide a grace period of 31 days after the due date. If the insured dies during the grace period, the insurance company may deduct any premium due from the death benefit.\n\n   ◦ The maximum fixed policy loan interest rate that an insurer can charge in Florida is 10%. Adjustable rates for policy loans are based on Moody’s corporate bond index.\n\n   ◦ In Florida, if a policy is made payable to a named beneficiary, a creditor can make no claim on the proceeds.\n\n   ◦ In Florida, anyone over the age of 64 will receive an additional 21 days beyond the normal policy grace period.\n\n   ◦ In Florida, if an insured commits suicide within 2 years of policy issue, the beneficiary will only receive a refund of premiums paid. After two years, the face amount will be paid in the event of suicide.\n\n   ◦ When an insured has industrial life insurance policies with a single insurance company that total $3,000 or more in face value, the insured has the option to convert all of these policies into one ordinary life insurance policy at standard premium without evidence of insurability.\n\n   ◦ An insurance company that requires an application for reinstatement has 45 days to reject the application before reinstatement is automatic. In other words, if the insurer takes no action within 45 days, the policy is considered reinstated automatically.\n\n   ◦ Under Florida law, \"excess business\" is permitted when an agent's own company is not able to write the amount of insurance requested by the applicant. Excess business is that portion of a risk above the limits of that which the agent’s own insurer will accept. A licensed life agent may place excess or rejected risks with any other authorized insurer without being required to secure an appointment as to such other insurer.\n\n   ◦ Excess charges occur when an agent knowingly collects money for a premium or an additional charge for insurance that is not provided for in the policy.\n\n   ◦ ERISA supersedes Florida state law relating to employee retirement plans. The savings clause in ERISA protects the following areas of state regulation: Insurance Banking\n\n• Securities Agent Responsibilities\n\n   ◦ The Solicitation Law: spells out the information and procedures required of agents and insurers when proposing life insurance to a prospective buyer;\n\n   ◦ Replacement Rule: sets forth the requirements and procedures to be followed by insurance companies and agents when a proposal is being made in which a prospective life insurance buyer will be replacing existing insurance contracts with the proposed new insurance;\n\n   ◦ Code of Ethics: establishes a broad outline defining appropriate and inappropriate business behavior for life insurance agents;\n\n   ◦ Replacement is strictly regulated and requires full disclosure by both the agent and the replacing insurance company. Replacement regulations exists to assure that purchasers receive specified information and it also reduces the opportunity for misrepresentation.\n\n   ◦ Duties of the replacing agent:\n\n• Present to the applicant a Notice Regarding Replacement that is signed by both the applicant and the agent. A copy must be left with the applicant.\n\n• Obtain a list of all existing life insurance and/or annuity policies to be replaced including policy numbers and the names of all companies being replaced.\n\n• Leave the applicant with the original or a copy of written or printed communications used for presentation to the applicant.\n\n• Submit to the replacing insurance company a copy of the Replacement Notice with the application.\n\n• An agent must disclose the possible tax consequences of replacing or exchanging an existing annuity or life insurance policy.\n\n   ◦ Duties of the replacing insurance company:\n\n• Require from the agent a list of the applicant's life insurance or annuity contracts to be replaced and a copy of the replacement notice provided to the applicant.\n\n• Send each existing insurance company a written communication advising of the proposed replacement within a specified period of time of the date that the application is received in the replacing insurance company's home or regional office. A policy summary or ledger statement containing policy data on the proposed life insurance or annuity must be included.\n\n   ◦ The replacement of existing life insurance policies with new contracts of life insurance requires a written Comparison and Summary Statement at the policyowner's request.\n\n   ◦ An agent's attempt to stop the replacement of an existing life insurance policy or annuity is known as conservation.\n\n   ◦ Instead of a policy, the participants under a group plan are issued certificates of insurance as evidence that they have coverage. Each person insured under a Group Life insurance policy is a certificate holder.\n\n   ◦ In Florida, group life policies must contain a conversion privilege that allows for conversion to an individual policy for a specified period of time. Converted individual policies do not require evidence of insurability.\n\n   ◦ Participants are given a period of time, known as the eligibility period, to join the group plan. Other plans use an open enrollment period, in which case all new employees must wait until the next enrollment period\n\nbefore joining the group plan. In Florida, there is no minimum number of insureds required for a group life insurance policy.\n\n   ◦ The employees eligible for group insurance under the\n\npolicy shall be all of the employees of the employer.\n\n   ◦ In the event of a termination of a group life plan or\n\ntermination of a covered employee, a person covered by a group policy has the right to convert such coverage to an individual policy within the conversion period (31 days) without proving insurability. If this right is exercised, the employee is responsible for the payment of premium.\n\n   ◦ There are no restrictions regarding the assignment of\n\ncoverage under a group life insurance policy.\n\n   ◦ An insurer must notify each certificate holder (employee)\n\nwhen the master policy has expired or is being cancelled. The insurer may take such action through the policyholder (employer).\n\n   ◦ Fraternal life insurance organizations are nonprofit\n\nproviders of life insurance that is covered by a special section of the Florida insurance code.\n\n   ◦ The following entities for selling life insurance are legal\n\nin the State of Florida;\n\n   ◦ Personal producing general agencies Independent agency systems Career agency systems\n\n   ◦ In a noncontributory group, the policy must cover 100%\n\nof eligible persons.\n\n   ◦ Viatical Settlements allows someone with a terminal illness to sell their existing life insurance policy to a third party for a percentage of the face value. To receive a percentage of the policy face value, an owner of a life policy may sell the policy to a viatical settlement provider. The new owner continues to make the premium payments and will eventually collect the entire death benefit. Viatical settlement brokers must be licensed before conducting any viatical transactions. Proceeds of the viatical settlement contract could be subject to the claims of creditors.\n\n   ◦ An agent who wants to sell Variable annuities must be licensed by the state, which includes examinations in Life and Variable contracts.\n\n   ◦ Standards and procedures are in existence to ensure that anyone looking to purchase, exchange, or replace an annuity is properly informed and the recommendations given to them are in their best interests. The intended goal of this regulation is a consumer who has had their insurance needs and financial objectives properly addressed."
    },
    {
      "title": "Florida Laws Pertinent to Health Insurance",
      "id": "health_insurance",
      "content": "INSURANCE\n\n   ◦ Required provisions\n\n• Entire contract: A provision that the policy, application, and all attachments shall constitute the entire contract between the parties.\n\n• Time limit on certain defenses (Incontestable Period): A health or disability policy is incontestable after it has been in force for a period of 2 years. Only fraudulent misstatements in the application may be used to void the policy or deny any claim at this point.\n\n• Grace Period: The grace period for health and accident insurance is required to be no less than 7 days for weekly premium policies, 10 days for monthly premium policies and, 31 days for all other policies. If premium is paid within the grace period, coverage shall remain in effect.\n\n• Reinstatement: If a health policy is reinstated after it had lapsed for nonpayment, there is a waiting period of 10 days before a claim covering sickness will be covered. Injuries sustained from an accident, however, will be covered immediately. If the insurer takes no action within 45 days after receiving the reinstatement application, the policy is considered automatically reinstated\n\n• Notice of claim: Written notice of a claim must be given within 20 days after a covered loss starts or as soon as reasonably possible.\n\n• Claim forms: An insurance company will send forms for filing proof of loss to a claimant within 15 days after company receives notice of a claim.\n\n• Proof of loss: Written proof for any loss must be given to the insurance company within 90 days.\n\n• Time payment of claims: The time payment of claims provision allows insurers 45 days after receiving notice and proof of loss in which to pay or deny the claim. The minimum schedule of time in which claims MUST be made to an insured under an Individual Disability policy is monthly\n\n• Right to examine (free-look): Health insurance policies must provide a minimum free-look period of 10 days upon policy delivery. This allows the policyowner time to decide whether or not to keep it. If the policyowner decides not to keep the policy within the 10 days allowed, a full refund will be given.\n\n• Legal Actions: No legal action can be initiated within 60 days after proof of loss has been submitted to the insurance company. In addition, no legal action can be initiated after 5 years from the initial time written proof of loss has been provided.\n\n   ◦ Advertisements\n\n• All advertisements for health insurance shall make clear the identity of the insurer\n\n• Insurance companies are responsible for the accuracy of testimonials\n\n   ◦ Physical Exams and Autopsies: The insurer has the right to examine the insured during the claim process and to order an autopsy when death is involved and where it is not forbidden by law.\n\n   ◦ Illegal occupation: The insurer shall not be liable for any loss to which a contributing cause was the insured being engaged in a felony or illegal occupation.\n\n   ◦ Change of beneficiary: The change of beneficiary provision allows the policyowner to change the policy beneficiary, if so desired, as long as the beneficiary designation is revocable. This provision also gives the policyowner the right to surrender or assign the policy without obtaining the beneficiary’s permission.\n\n   ◦ Florida law prohibits individual health insurance policies (other than disability income insurance) from excluding coverage for preexisting conditions for longer than 24 months following the effective date of coverage, based upon a condition that had manifested itself during the previous 24-month period in such a manner as would cause an ordinarily prudent person to seek medical advice or treatment.\n\n   ◦ For group health insurance: Pre-existing conditions (conditions for which medical advice, diagnosis, care or treatment was recommended or received in the 6 months prior to the effective date of enrollment) may be excluded for a maximum of 12 months from the date of enrollment (18 months for late enrollees). Creditable coverage will be used to reduce the exclusion period, unless the individual has a coverage gap of 63 days prior to enrollment in the group plan.\n\n• The underwriting and issuance of a master group health policy in Florida requires that all employees or members must be eligible to participate regardless of individual health history\n\n   ◦ When a person covered by a health insurance plan moves to another plan, any credit toward fulfilling the preexisting requirement on the prior plan will be transferred to the new plan.\n\n   ◦ Florida Eligibility Requirements and Offers\n\n• Newborn child coverage: All health plans that provide coverage to family members of the insured, must provide coverage for the insured’s newborn child from the moment of birth for a period of 18 months.\n\n• Handicapped children: In Florida, coverage for a child who is dependent on the parents for support due to a physical handicap may be continued beyond the contractual limiting age when the child is incapable of self sustaining employment.\n\n• Adopted and prospective adopted children: All health plans must provide coverage to the insured’s adopted children on the same basis as other dependents.\n\n• Substance abuse: All health plans must provide benefits when an insured is confined for treatment of alcoholism or drug abuse in a licensed medical care facility.\n\n• Mental Health: All health plans must provide benefits when an insured is confined for in-patient treatment of mental illness in a licensed medical care facility.\n\n• Converted policies: At the option of the insurer, a separate converted policy may be issued to cover a dependent.\n\n• Genetic testing: The use of genetic information or test results by health insurers or HMO’s is prohibited.\n\n   ◦ A small employer is one that employs not more than 50 employees. When offering a health benefit plan to small employers, the carrier MUST offer at least the standard plan.\n\n• A small employer carrier that offers health coverage in the small employer group market shall renew or continue in force that plan at the option of the small employer\n\n   ◦ Exclusive Provider Organization: A provider that has entered into a written agreement with a health insurance company to provide health care services for certain insureds. It can offer these services through its own facilities or a network of health care professionals, or it may use another facility, such as an HMO.\n\n   ◦ Dread disease policies: Dread Disease policies cover a single disease or illness only.\n\n   ◦ Discount Medical Plan: An arrangement or contract in\n\nwhich a person, in exchange for fees or other consideration, provides access for plan members to the services of providers of medical services at a discount.\n\n   ◦ Contributory group plan: Under Florida law, there is no\n\nspecific minimum percentage participation for employees covered by employee group health insurance.\n\n   ◦ Coordination of benefits (COB): The purpose of the\n\ncoordination of benefits (COB) provision, found only in group health plans, is to avoid duplication of benefit payments.\n\n   ◦ Association plans: Association Plans must be fully insured\n\nby an authorized insurer, so the insurer is subject to state regulation.\n\n   ◦ A Prepaid Limited Health Service Organization (PLHSO)\n\nis any person, corporation, partnership, or any other entity that, in return for a prepayment, undertakes to provide or arrange for, or provide access to, the provision of a limited health service to enrollees through an exclusive panel of providers for the following services:\n\n   ◦ Ambulance services Dental care services Vision care services Mental health services Substance abuse services Chiropractic services Podiatric care services Pharmaceutical services\n\n   ◦ The Consolidated Omnibus Budget Reconciliation Act (COBRA) is a federal law that requires employers with 20 or more employees to include a continuation of benefits provision for former employees and their dependents. COBRA guarantees that the participant can continue the group coverage (at their own expense) at group rates if their participation in the group plan is terminated because of a qualifying event.\n\n• Qualifying events: include the death of the employee; termination of employment (except for termination because of gross misconduct); or a reduction in work hours, which results in the participant no longer qualifying for group coverage.\n\n• It is important to remember that COBRA benefits apply only to group health insurance, not group life insurance.\n\n• Employees who have been covered under a group health plan for at least 3 months before their termination are eligible to continue their coverage under COBRA. They must request continuation within 31 days following termination.\n\n• Florida's Health Insurance Coverage Continuation Act (Mini COBRA) applies to employers who employ less than 20 employees.\n\n   ◦ The purpose of the Florida Employee Health Care Access Act is to make group health insurance available to employers with 50 or fewer employees.\n\n   ◦ Florida Healthy Kids offers health insurance for children ages 5-18. Healthy Kids is designed to provide quality, affordable health insurance for families not eligible for Medicaid.\n\n   ◦ Long-term care insurance is designed to provide coverage for diagnostic, preventive, therapeutic, rehabilitative, maintenance, or personal care services in a setting other than an acute care unit of a hospital.\n\n• A “notice to buyer” must be on the first page of each long-term care policy delivered. It explains that some long-term care costs may not be covered.\n\n• An outline of coverage is required and provides a very brief description of the important features of the policy. It is considered a summary of coverage. It requires:\n\n   ◦ A summary of the policy's principal exclusions and limitations\n\n   ◦ A statement of the policy’s renewal and cancellation provisions\n\n   ◦ A description of the policy’s principal benefits and coverage\n\n• Individual long-term care insurance policies shall contain an appropriately captioned renewability provision on the first page of the policy form.\n\n   ◦ The renewability provision shall clearly state that the coverage is guaranteed renewable or noncancellable\n\n• Pre-existing conditions are those for which medical advice or treatment was recommended by or received from a health provider within six months preceding the effective date of an individual long- term care policy.\n\n• A 30 day free look period is required for long-term care policies.\n\n• All insurers issuing long-term care insurance policies must offer, as an optional benefit, an inflation protection feature which provides for automatic future increases in the level of benefits without evidence of insurability. Adjustments must be at a level which provides reasonable protection from future increases in the costs of care for which benefits are provided.\n\n• An insurer must mail a long-term care lapse notice at least 30 days prior to the effective date of cancellation to both the policyholder and a specified secondary addressee.\n\n• Long-term care policies must pay for \"at-home\" care at the same daily amount as paid for a nursing home if the insured meets the qualifications for nursing home care.\n\n• Exclusion or limitation of benefits on the basis of Alzheimer’s Disease is NOT permitted. However, limits and exclusions may be placed on:\n\n   ◦ Preexisting conditions or diseases\n\n   ◦ Alcoholism and drug addiction\n\n   ◦ War or acts of war\n\n   ◦ Participation in a felony, riot or insurrection\n\n   ◦ Suicide or self-inflicted injury\n\n   ◦ Aviation (except for fare-paying passengers)\n\nMEDICARE SUPPLEMENTS\n\n• Insurers must file with the Commissioner a copy of any Medicare supplement advertisement before it is to be used in Florida\n\n• The marketing of Medicare Supplements is regulated to prevent sales of excessive insurance, inaccurate policy comparisons, and the failure to display notice of limitations to the buyer\n\n• The agent who solicits the application is primarily responsible for determining the appropriateness of a Medicare supplement policy for a proposed insured\n\n• Every agent soliciting Medicare Supplements must provide a suitability form\n\n• To verify if replacement is involved in a Medicare Supplement sale, insurance law requires that a question about replacement appear on the application form\n\n• If a Medicare Supplement policy is sold, the agent must deliver an Outline of Coverage to the applicant no later than when the application is taken\n\n• When a Medicare supplement policy is purchased during the open enrollment period, the policy must be issued regardless of health status\n\n• Free-look period for Medicare Supplements is 30 days\n\n• The open enrollment period for Medicare (and Medicare Supplements) begin 3 months before your 65th birthday and lasts for 7 months\n\n• An insurer may exclude coverage for a preexisting condition on a Medicare Supplement Policy for up to 6 months.\n\nProhibited Long-term care and Medicare Supplement Sales Practices\n\n• Twisting: Using misrepresentations or inaccurate comparisons to induce a person to terminate or borrow against their current insurance policy to take out an insurance policy with another insurer\n\n• High pressure tactics: Used to induce the purchase of insurance through force, fright, threat, or undue pressure\n\n• Cold lead advertising: Failing to disclose that the purpose of the marketing effort is insurance solicitation\n\n• Misrepresentation: Misrepresenting a material fact in selling a long- term care insurance policy\n\nHMO DEFINITIONS\n\n• Member: A person who makes a contract or on whose behalf a contract is made with a health maintenance organization for health care services.\n\n• Provider: Any person, including a physician or hospital, who is licensed or otherwise authorized in this state to provide health care services.\n\n• Subscriber: A person who makes a contract with a health maintenance organization, either directly or through an insurer or marketing organization, under which the person or other designated persons are entitled to the health care services.\n\n• Individual contract: A contractual agreement for the provision of health care services on a prepaid basis entered into between an HMO and a subscriber covering the subscriber and the subscriber’s dependents.\n\nDENTAL\n\n• Restorative dentistry is the procedure for restoring the function and integrity of a missing tooth structure. Examples include fillings, crowns, and dental bridges.\n\n• Oral and maxillofacial surgery is surgery to treat many diseases, injuries and defects in the head, neck, face, jaws and the hard and soft tissues of the oral and maxillofacial region.\n\n• Endodontics is the branch of dentistry dealing with diseases of the dental pulp. Root canals would be an example. Endodontics is commonly excluded or limited from a dental policy.\n\n• Periodontics is a dental specialty that involves the prevention, diagnosis and treatment of disease of the supporting and surrounding tissues of the teeth or their substitutes. It also involves the maintenance of the health, function, and esthetics of these structures or tissues.\n\n• Prosthodontics is a branch of dentistry dealing with the replacement of missing parts using biocompatible substitutes such as bridgework or dentures\n\n• Orthodontics is the treatment of irregularities in the teeth (esp. of alignment and occlusion) and jaws, including the use of braces.\n\n• Occasionally, dental insurance is part of a health benefits package with a single deductible called an integrated deductible, applying to both medical and dental coverages. More often, however, dental coverage and claims are handled separately with a separate deductible. There also may be a probationary period in group dental insurance to help hold down coverage for preexisting conditions. Some dental policies are scheduled, meaning benefits are limited to specified maximums per procedure, with first dollar coverage. Most, however, are comprehensive policies that work in much the same way as comprehensive medical expense coverage. In addition to deductibles, coinsurance and maximums may also affect the level of benefits payable under a dental plan.\n\nPATIENT PROTECTION AND AFFORDABLE CARE ACT (PPACA OR ACA)\n\n• Exchanges: Created by the Affordable Care Act (ACA) health reform bill to help individuals and small businesses purchase health insurance coverage. The purposes of the exchange include:\n\n   ◦ Reduce the number of uninsured in the state\n\n   ◦ Facilitate the purchase and sale of qualified health plans in the individual market\n\n   ◦ Assist qualified employers in the state in enrolling their employees in qualified health plans\n\n   ◦ Assists individuals in accessing public programs, premium tax credits, and cost-sharing reductions\n\n• Under the Affordable Care Act (ACA), the health insurance exchange will perform all of the following roles:\n\n   ◦ Certify health plans as qualified, based on pre-determined criteria\n\n   ◦ Utilize individual, unique formats for presenting health benefit plan options\n\n   ◦ Verify and resolve inconsistent information provided to the exchange by applicants\n\n• Essential health benefits\n\n   ◦ Beginning January 1, 2014, the exchange shall allow any qualified plans that meet the minimum standards established by the exchange to be offered in the exchange. All plans must include the following: Ambulatory patient services Emergency services Hospitalization Maternity and newborn care Mental health and substance use disorder\n\nservices, including behavioral health treatment\n\n   ◦ Prescription drugs Rehabilitative services and devices Laboratory services Preventative and wellness services and\n\nchronic disease management\n\n   ◦ Pediatric services, including oral and vision\n\ncare\n\n   ◦ Metal levels\n\nThere are four tiers of \"qualifying health plans\" you or your employer can\n\npurchase on the exchange. They range from lower quality, but more\n\naffordable \"Bronze plans\", to \"Silver plans\" to a more expensive plan\n\nwith better coverage called a \"Gold plan\". There is also a \"Platinum\n\nplan\" which is the highest quality and cost plan. Lower premium plans\n\nwill have higher deductibles, less benefits and larger out of pocket costs.\n\nThe actuarial level is calculated as the percentage of total average cost\n\nfor covered benefits that a plan will cover.\n\n   ◦ Bronze Plans: 60% actuarial level of coverage provided\n\n   ◦ Silver Plans: 70% actuarial level of coverage provided\n\n   ◦ Gold Plans: 80% actuarial level of coverage provided\n\n   ◦ Platinum Plans: 90% actuarial level of coverage provided\n\n   ◦ Health plans cannot limit or deny benefits or deny coverage for a child younger than age 19 because of preexisting conditions. This applies to both group and individual policies.\n\n   ◦ The ACA prohibits health plans from putting lifetime dollar limits on most benefits that are received by an insured.\n\n• For plans starting on or after September 23, 2012, but not before January 1, 2014, the annual dollar limit is $2 million. After January 1, 2014, there are no annual dollar limits\n\n• Plans are allowed to put an annual dollar limit on health care services that are not considered essential\n\n   ◦ Grandfathered plans are plans that were purchased before March 23, 2010. These plans do not have to follow the ACA’s rules and regulations or offer the same benefits, rights and protections as new plans.\n\n• An exception to this is, a grandfathered plan cannot impose lifetime limits on how much health care coverage people may receive\n\n• Grandfathered health plans may lose their grandfathered status if the insurer significantly raises coinsurance charges, deductibles, or co- payment charges.\n\nOTHER ACA REQUIREMENTS\n\n• As defined by the Affordable Care Act, the MAXIMUM amount an individual can contribute to a Flexible Savings Account is $2,500\n\n• Under the Affordable Care Act (ACA), parents can insure their dependent adult children up to their 26th birthday, even if they are married or not living with their parents\n\n• Low-income individuals and families whose incomes are between 100% and 400% of the federal poverty level will receive federal subsidies on a sliding scale if they purchase insurance via an exchange\n\n• Beginning January 1, 2014, the Patient Protection and Affordable Care Act (ACA) will require adjusted community rating in the small group market. Small group health plans will be allowed to vary rates only based on whether the policy covers an individual or family, geographic area, age, and tobacco use\n\n• If an insurer fails to adhere to the Affordable Care Act requirements related to internal appeals, the internal appeal may be deemed exhausted for purposes of submitting an external review\n\n• According to the Affordable Care Act, if a large employer does NOT provide health insurance and owes an employer mandate penalty, the annual penalty is calculated by multiplying $2,000 by the number of full time employees minus 30\n\n• On or after January 1, 2014, employers with no more than 25 full time equivalent (FTE's) with average annual wages of less than $50,000 may be eligible for a tax credit of up to 50% of the premiums paid by the employer\n\n• You may qualify for employer health care tax credits through SHOP if you have fewer than 25 full-time employees making an average of about $50,000 a year or less"
    }
  ]
}